cases/chpt4-paraboloid-slow/0/alpha.Phase1.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.Phase1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    sym
    {
        type            symmetry;
        /*
        type        zeroGradient;
        type            codedFixedValue;
        value           uniform 1;
        name            swirlster;
        code            #{
         const fvPatch& boundaryPatch = patch();
         const vectorField& Cf = boundaryPatch.Cf();
         scalarField& field = *this;

         field = patchInternalField(); 
            forAll(Cf, facei)
            {
                field[facei] = 0.5;
            }
        #};
            */
    }
    top
    {
        type            zeroGradient;
    }
    btm
    {
        type            zeroGradient;
    }
    side1Andside2Andside3
    {
        type            zeroGradient;
    }
}
