cases/chpt4-paraboloid-slow/constant/sourceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sourceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sourceVel (-0.00125 0 0);
sourcePos0 (0 0 0.006);
sourcePos1 (0 0 0);
sourcePos2 (0 0 0);
sourceOmega 0.002333;//
sourcePenn  0.00265;//
sourceStartTime 0;
sourcePauseTime 10;
sourceEndTime 1e3;
sourcePower 1742;
sourceC_C 40;//35;//30;//25;
sourceFieldCut 0.05;

sourcePause true;
sourceTwo false;
sourceThree false;
oneMeter 1;